export const educationalInstitutionsDictionary = {
  UNI: {
    TECH: [
      { name: 'ČVUT — Прага', faculties: ['Факультет інформаційних технологій', 'Електротехнічний факультет'] },
      { name: 'VUT — Брно', faculties: ['Факультет ІТ', 'Механіко-енергетичний/машинобудування'] },
      { name: 'MUNI — Брно', faculties: ['Факультет інформатики', 'Факультет природничих наук (Data Science)'] }
    ],
    MED: [
      { name: 'Університет Карла — Прага', faculties: ['Медичний факультет', 'Факультет природничих наук (біомедицина)'] },
      { name: 'Масарик Університет — Брно', faculties: ['Медичний факультет', 'Факультет природничих наук (біохімія)'] },
      { name: 'Палацький Університет — Оломоуц', faculties: ['Медичний факультет', 'Факультет медичних наук'] }
    ],
    HUM: [
      { name: 'Університет Карла — Прага', faculties: ['Факультет соціальних наук', 'Філософський факультет'] },
      { name: 'Масарик Університет — Брно', faculties: ['Факультет соціальних студій', 'Філософський факультет'] },
      { name: 'Палацький Університет — Оломоуц', faculties: ['Філософський факультет', 'Педагогічний факультет'] }
    ],
    ECO: [
      { name: 'VŠE — Прага', faculties: ['Факультет фінансів і бухгалтерського обліку', 'Факультет міжнародних відносин'] },
      { name: 'Масарик Університет — Брно', faculties: ['Економіко-адміністративний факультет', 'Факультет інформатики (бізнес-аналітика)'] },
      { name: 'ČZU — Прага', faculties: ['Факультет економіки та менеджменту', 'Факультет агробіології (агробізнес)'] }
    ],
    NAT: [
      { name: 'Університет Карла — Прага', faculties: ['Факультет природничих наук', 'Математико-фізичний факультет'] },
      { name: 'Масарик Університет — Брно', faculties: ['Факультет природничих наук', 'Факультет наук про Землю'] },
      { name: 'VŠCHT — Прага', faculties: ['Факультет хімічної технології', 'Факультет хімічного інжинірингу'] }
    ]
  },
  SCHOOL_TYPES: {
    TECH: ['Середня промислова школа (SPŠ)', 'Ліцей інформатики', 'Гімназія (математичний профіль)'],
    MED: ['Гімназія з природничим ухилом', 'Середня медична школа', 'Ліцей з біології/хімії'],
    HUM: ['Гуманітарна гімназія', 'Педагогічна школа', 'Ліцей суспільних наук'],
    ECO: ['Obchodní akademie (економічний ліцей)', 'Гімназія (економічний профіль)', 'Ліцей бізнесу'],
    NAT: ['Природничий ліцей', 'Гімназія з акцентом на біологію/географію', 'SPŠ (хімічна)']
  }
} as const;

export type DirectionType = keyof typeof educationalInstitutionsDictionary.UNI;
export type SchoolDirectionType = keyof typeof educationalInstitutionsDictionary.SCHOOL_TYPES;
